<template>
        <section class="page">
        <h1>فرم مجوز دفاع از پایان نامه کارشناسی ارشد</h1>
        <div class="frame">
            <h2>مدیر محترم گروه </h2>
            <p>
                با سلام، احتراما به اطلاع می‌رساند پایان نامه
                {{ model.myname() }}
                دانشجوی دوره غیر انتفاعی ورودی
                {{ model.entrance_year }}
                با عنوان
                {{ model.title }}
                که به پیوست ضمیمه است آماده دفاع می باشد.
                کد پایان نامه ثبت شده در سامانه پژوهشی
                {{ model.irandoc }}
                می باشد.
            </p>
            <p>
                استادان مدعوّ خارجی و داخلی و تاریخ برگزاری از نظر اینجانب به قرار زیر پیشنهاد می گردند:
            </p>
        </div>
        <div class="frame stamp-place">
            <h2>معاونت محترم آموزشی</h2>
            <p>
                با سلام، بر اساس بررسی انجام شده دانشجو . آقای حامد مصافی کلیه واحد های درسی دوره کارشناسی ارشد رشته
                نرم‌افزار را به تعداد ............................. واحد گذرانده اند.
            </p>
            <div class="text-right">
                <h2>مهر و امضای کارشناس آموزش موسسه</h2>
            </div>
        </div>
        <div class="frame stamp-place">
            <h2>مدیر تحصیلات تکمیلی</h2>
            <p>
                بر اساس گزارش کارشناس محترم آموزش، دفاع از پایان نامه دانشجو
                {{ model.myname() }}
                بلا مانع است.
            </p>
            <div class="text-right">
                <h2>مهر و امضای معاونت آموزشی موسسه</h2>
            </div>
        </div>

        <div class="frame stamp-place">
            <h2>مدیر محترم گروه {{ model.field }}</h2>
            <p>
                با سلام، با توجه به بررسی انجام شده، برگزاری جلسه دفاع از پایان نامه
                {{ model.myname() }}
                بلامانع است/ مقدور نیست.
            </p>
            <div>
                علت عدم امکان دفاع: وضعیت آموزشی
                <div class="sq"></div>
                سایر موارد
                <div class="sq"></div>
                با ذکر مورد: .............................................
            </div>
            <div class="text-right">
                <h2>مهر و امضای مدیر تحصیلات تکمیلی موسسه</h2>
            </div>
        </div>

        <div class="frame stamp-place">
            <h2>مدیر محترم گروه {{ model.field }}</h2>
            <p>
                با سلام،
                {{ model.myname() }}
                با این واحد تسویه حساب نموده و برگزاری جلسه دفاع ایشان از نظر این واحد بلامانع است.
            </p>
            <div class="text-right">
                <h2>مهر و امضای مدیر امور مالی موسسه</h2>
            </div>
        </div>
        <div class="frame stamp-place">
            <h2>مدیر محترم گروه {{ model.field }}</h2>
            <p>
                همکار گرامی، به پیوست یک نسخه پایان‌نامه جهت اظهار نظر در خصوص پذیرش داوری و تعیین زمان پیشنهادی تقدیم
                می‌گردد.
            </p>
            <div class="text-right">
                <h2>مهر و امضای مدیر گروه</h2>
            </div>
            <p>
                نام داور1:
                {{ model.drname('arbiter') }}
                یک نسخه پایان نامه دریافت گردید. زمان برگزاری دفاع مورد قبول است.
                <b>امضاء و تاریخ</b>
            </p>
        </div>
        <div class="frame stamp-place">
            <h2>مدیر محترم تحصیلات تکمیلی موسسه</h2>
            <p>
                با سلام، با توجه به اعلام آمادگی استاد راهنما، مشاور و داوران خواهشمند است نسبت به صدور مجوز دفاع از
                پایان‌نامه یاد شده و دعوت از هیأت داوران اقدام فرمایید. تاریخ و ساعت برگزاری
                ................................ محل برگزاری ......................................
            </p>
            <div class="text-right">
                <h2>مهر و امضای مدیر گروه</h2>
            </div>
        </div>
        <div class="frame stamp-place">
            <h2>مدیر محترم گروه {{ model.field }}</h2>
            <p>
                سلام، ضمن تأیید امکان دفاع،
                <b>{{ model.full_name('agent') }}</b>
                با مرتبه
                <b>{{ model.agent_grade }}</b>
                از گروه
                <b>علوم انسانی</b>
                بعنوان نماینده
                <b>تحصیلات تکمیلی</b>
                در جلسه دفاع معرفی می‌شوند.
            </p>
            <div class="text-right">
                <h2>مهر و امضای معاون پژوهشی موسسه</h2>
            </div>
        </div>
        <div class="frame stamp-place">
            این فرم باید حداقل 15 روز قبل از دفاع به تحصیلات تکمیلی موسسه تحویل داده شود.
        </div>
    </section>

</template>

<script>
export default {
    name: "DefenseLicense",
    props: {
        model: Object
    }
}
</script>