<template>
    <section class="page">
        <h1>فرم ارزشیابی پایان نامه کارشناسی ارشد</h1>
        همکار محترم 
        <strong>{{ model.drname(dr) }}</strong>
        عضو هیات داوران جلسه دفاعیه پایان نامه کارشناسی ارشد 
        <strong>{{ model.myname() }}</strong>
        دانشجوی رشته 
        <strong>{{ model.field }}</strong>
        گرایش
        <strong>{{ model.orientation }}</strong>
        با عنوان
        <strong>{{ model.title }}</strong>
        نظرات خود را اعلام فرمایید.
        <h1>مهر و امضای مدیر تحصیلات تکمیلی موسسه</h1>

        <table class="lines">
            <tr>
                <th>عنوان</th>
                <th>حداکثر نمره</th>
                <th>نمره پیشنهادی</th>
                <th>ملاحظات</th>
            </tr>
            <tr>
                <td>
                    ۱- چگونگی تنظیم و تدوین مطالب و حسن نگارش
                </td>
                <td>۲</td>
                <td></td>
                <td></td>
            </tr>
            <tr>
                <td>
                    ۲-به کارگیری مناسب جدول ها، منحنی ها و شکل ها برای تشریح مطالب
                </td>
                <td>۱/۵</td>
                <td></td>
                <td></td>
            </tr>
            <tr>
                <td>
                    ۳- ارزش علمی یا کاربردی مطالب ارائه شده
                </td>
                <td>۳</td>
                <td></td>
                <td></td>
            </tr>
            <tr>
                <td>
                    ۴- کیفیت و کمیت استفاده از منابع و ماخذ و به روز بودن آنها
                </td>
                <td>۲</td>
                <td></td>
                <td></td>
            </tr>
            <tr>
                <td>
                    ۵- چگونگی تجزیه و تحلیل ، بحث و نتیجه گیری
                </td>
                <td>۳</td>
                <td></td>
                <td></td>
            </tr>
            <tr>
                <td>
                    ۶- ارائه نظريات جدید و پیشنهاد برای ادامه کار
                </td>
                <td>۱</td>
                <td></td>
                <td></td>
            </tr>
            <tr>
                <td>
                    ۷- چگونگی ارائه پایان نامه در جلسه دفاعیه
                </td>
                <td>۲/۵</td>
                <td></td>
                <td></td>
            </tr>
            <tr>
                <td>
                    ۸- توانایی دانشجو در پاسخ به سوالات
                </td>
                <td>۳</td>
                <td></td>
                <td></td>
            </tr>
            <tr>
                <td>
                    ۹- مقاله مستخرج از پايان نامه *
                </td>
                <td>۲**</td>
                <td></td>
                <td></td>
            </tr>
            <tr>
                <td>
                    نمره پایان نامه
                </td>
                <td></td>
                <td></td>
                <td></td>
            </tr>
        </table>
        <br /><br />

        <table class="lines">
            <tr>
                <th>
                    نوع مقاله
                </th>
                <th>
                    امتياز بازاي هر مقاله
                </th>
                <th>
                    امتياز قابل محاسبه
                </th>
            </tr>
            <tr>
                <td>
                    <ul>
                        <li>
                            چاپ يا پذيرش مقاله علمي در نشريه علمي پژوهشي يا نشريه نمايه شده معتبر ملي يا بين المللي
                        </li>
                    </ul>
                </td>
                <td>
                    تا ۲ امتياز
                </td>
                <td rowspan="2"> ۲ </td>
            </tr>
            <tr>
                <td>
                    <ul>
                        <li>
                            چاپ يا پذيرش مقاله علمي در نشريه علمي ترويجي
                        </li>
                    </ul>
                </td>
                <td>
                    تا
                    ۱/۷۵
                    امتياز
                </td>
            </tr>
            <tr>
                <td>
                    <ul>
                        <li>
                            ارائه يا پذيرش مقاله كامل در سمينارهاي ملي يا بين المللي
                        </li>
                    </ul>
                </td>
                <td>
                    تا ۱/۵ امتياز
                </td>
                <td rowspan="2">
                    ۱/۵
                </td>
            </tr>
            <tr>
                <td>
                    <ul>
                        <li>
                            ارائه يا پذيرش خلاصه مقاله در سمينارهاي ملي يا بين المللي
                        </li>
                    </ul>
                </td>
                <td>
                    تا ۱ امتياز
                </td>
            </tr>
            <tr>
                <td>
                    <ul>
                        <li>
                            ارائه يا پذيرش مقاله در سمينارهاي داخل دانشگاه
                        </li>
                    </ul>
                </td>
                <td>
                    تا ۰/۷۵ امتياز
                </td>
                <td>
                        ۱
                </td>
            </tr>
            <tr>
                <td colspan="3">
                    <sup>* </sup>در
                    خصوص دانشجويان رشته معماري، يك امتياز از بند ۹ جدول فوق مي تواند به ميزان ۰/۵ امتياز به هر يك از
                    بندهاي ۱ و ۲ اضافه شود.
                </td>
            </tr>
            <tr>
                <td colspan="3">
                    تبصره: لازم به ذكر است در صورت دارا نبودن مقاله در نشريات علمي پژوهشي ، علمي ترويجي يا ساير نشريات
                    نمايه شده معتبر ، مجموع امتيازات ساير موارد مربوط به مقالات حداكثر ۱/۵ خواهد بود.
                </td>
            </tr>
        </table>

        <div class="frame">
                اصلاحاتي كه بايد در پايان نامه انجام گيرد:
                <br /><br /><br /><br /><br /><br /><br />
                <table>
                    <tr>
                        <td class="text-center" width="33%">نام و نام خانوادگي</td>
                        <td class="text-center" width="33%">تاريخ:</td>
                        <td class="text-center" width="33%">امضا</td>
                    </tr>
                </table>
        </div>
    </section>
</template>

<script>
export default {
    name: "Grade",
    props: {
        model: Object,
        dr: String,
    }
        // args: Array
    // },
    // computed: {
    //     ddr: args[0]
    // }
}
</script>