<template>
    <div>
        <h1>فرم‌ساز</h1>
        <p>
            به سامانه فرم‌ساز خوش آمدید
        </p>
        <p>
            با استفاده از این سامانه می‌توانید فرم‌های دانشگاهی مقطع کارشناسی ارشد موسسه آموزش عالی شهریار آستارا را چاپ کنید
        </p>
        <p>
            ابتدا از سمت چپ صفحه مورد نظر را انتخاب کرده سپس موارد خواسته شده را وارد کنید.
            سپس با مراجعه به بخش «انتخاب فرم‌ها» فرم‌های مورد نظر برای چاپ را انتخاب کنید.
            در نهایت با استفاده از دکمه چاپ می‌توانید فرم‌های مورد نظر را چاپ کنید.
        </p>
    </div>
</template>

<script>
export default {
    name: "Info"
}
</script>